package homework_08;

// В кинотеатре есть разные типы билетов: стандартный, студенческий (-10%) и для пенсионеров(-25%).
// Каждый тип билета имеет свою стоимость.
// Клиент может также выбрать место в VIP-зоне, что увеличит стоимость билета на 25%.
// Создайте метод calculateTicketPrice, который принимает возраст клиента, статус студента и флаг VIP-места,
// а возвращает итоговую стоимость билета. Реализуйте приложение-бот,
// которое задает необходимые вопросы и объявляет стоимость билета.

public class Ticket {

    public static void main(String[] args) {



    }
}
